In [1092]:
import pandas as pd
import numpy as np
import glob
import os

import string
from nltk.corpus import stopwords
from nltk import word_tokenize
from nltk.tokenize.treebank import TreebankWordDetokenizer

sw = stopwords.words('spanish')

from datetime import datetime

In [1093]:
ruta = os.getcwd() + '/data/'

In [1094]:
ruta

'/Users/cevalenciam/Library/CloudStorage/OneDrive-Personal/SmartBuy/smartbuy/data/'

### Tiendas

In [1095]:
df_tiendas_tottus = pd.read_excel('web-scraper-tottus/df_tiendas_tottus.xlsx')
df_tiendas_tottus['direccion'] = df_tiendas_tottus['direccion'].map(lambda x:x[:x.index("\n")])
df_tiendas_tottus['empresa'] = 'Tottus'
df_tiendas_tottus.head(3)

,region,comuna,direccion,imagen,latitud,longitud,comentario,empresa
0,Región Metropolitana,Alameda,"Av Libertador Bernardo O'Higgins 3470, Santiago",https://lh5.googleusercontent.com/p/AF1QipNBTs...,-33.452419,-70.682373,Dirección encontrada,Tottus
1,Región Metropolitana,Buín,"San Martín 174, Buin",https://lh5.googleusercontent.com/p/AF1QipObZ2...,-33.731760,-70.734828,Dirección encontrada,Tottus
2,Región Metropolitana,Catedral,"Catedral 1850, Santiago",https://lh5.googleusercontent.com/p/AF1QipNgsl...,-33.438856,-70.663054,Dirección encontrada,Tottus

In [1096]:
df_tiendas_lider = pd.read_excel('web-scraper-lider/df_tiendas_lider.xlsx')
df_tiendas_lider['empresa'] = 'Lider'
df_tiendas_lider.head(3)

,supermercado,comuna,direccion,disponibilidad,region,hora_apertura,hora_cierre,imagen,latitud,longitud,comentario,empresa
0,Express de Lider,Renca,"San Diego 219, Santiago",Abierto,Metropolitana,08:00,21:30,https://lh5.googleusercontent.com/p/AF1QipNcMr...,-33.447774,-70.651169,Dirección encontrada,Lider
1,Express de Lider,Santiago,"Curicó 517, Santiago",Abierto,Metropolitana,08:00,21:30,https://lh5.googleusercontent.com/p/AF1QipOznS...,-33.446068,-70.643188,Dirección encontrada,Lider
2,Express de Lider,Santiago,"San Pablo 2902, Santiago",Abierto,Metropolitana,08:00,21:30,https://lh5.googleusercontent.com/p/AF1QipNoxJ...,-33.435443,-70.673451,"Más de una dirección encontrada, toma la primera",Lider

In [1097]:
df_tiendas_jumbo = pd.read_excel('web-scraper-jumbo/df_tiendas_jumbo.xlsx')
df_tiendas_jumbo['empresa'] = 'Jumbo'
df_tiendas_jumbo.head(3)

,local,direccion,url_maps,lat,lon,imagen,latitud,longitud,comentario,comuna,region,empresa
0,Jumbo Pie Andino,"Avenida paseo pie andino 4770 , Lo Barnechea, ...",https://www.google.com/maps/search/?api=1&quer...,-33.325961,-70.517112,https://lh5.googleusercontent.com/p/AF1QipMF36...,-33.325562,-70.517186,Dirección encontrada,Lo Barnechea,Región Metropolitana,Jumbo
1,Jumbo Chamisero,"Av. Santa María 14.601, Colina, Región Metropo...",https://www.google.com/maps/search/?api=1&quer...,-33.321480,-70.645935,https://lh5.googleusercontent.com/p/AF1QipM-vf...,-33.321492,-70.646300,Dirección encontrada,Colina,Región Metropolitana,Jumbo
2,Jumbo Puertas de Chicureo,"Avendida Chicureo 130, Colina, Región Metropol...",https://www.google.com/maps/search/?api=1&quer...,-33.285435,-70.700211,https://lh5.googleusercontent.com/p/AF1QipNKQ5...,-33.285979,-70.700035,"Más de una dirección encontrada, toma la primera",Colina,Región Metropolitana,Jumbo

In [1098]:
vars_tiendas = ['direccion', 'comuna', 'region', 'imagen', 'latitud', 'longitud', 'empresa']

In [1099]:
df_tiendas_tottus_1 = df_tiendas_tottus[vars_tiendas]
df_tiendas_tottus_1.head(3)

,direccion,comuna,region,imagen,latitud,longitud,empresa
0,"Av Libertador Bernardo O'Higgins 3470, Santiago",Alameda,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipNBTs...,-33.452419,-70.682373,Tottus
1,"San Martín 174, Buin",Buín,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipObZ2...,-33.731760,-70.734828,Tottus
2,"Catedral 1850, Santiago",Catedral,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipNgsl...,-33.438856,-70.663054,Tottus

In [1100]:
df_tiendas_lider_1 = df_tiendas_lider[vars_tiendas]
df_tiendas_lider_1.head(3)

,direccion,comuna,region,imagen,latitud,longitud,empresa
0,"San Diego 219, Santiago",Renca,Metropolitana,https://lh5.googleusercontent.com/p/AF1QipNcMr...,-33.447774,-70.651169,Lider
1,"Curicó 517, Santiago",Santiago,Metropolitana,https://lh5.googleusercontent.com/p/AF1QipOznS...,-33.446068,-70.643188,Lider
2,"San Pablo 2902, Santiago",Santiago,Metropolitana,https://lh5.googleusercontent.com/p/AF1QipNoxJ...,-33.435443,-70.673451,Lider

In [1101]:
df_tiendas_jumbo['comuna'] = df_tiendas_jumbo['direccion'].map(lambda x:x[x.find(',')+2:x.find(',', x.find(',')+1)])
df_tiendas_jumbo['region'] = df_tiendas_jumbo['direccion'].map(lambda x:x[x.find(',', x.find(',')+1)+2:])

In [1102]:
df_tiendas_jumbo_1 = df_tiendas_jumbo[['direccion', 'comuna', 'region', 'imagen','lat', 'lon', 'empresa']].rename(columns={'lat':'latitud', 'lon': 'longitud'})
df_tiendas_jumbo_1.head(3)

,direccion,comuna,region,imagen,latitud,longitud,empresa
0,"Avenida paseo pie andino 4770 , Lo Barnechea, ...",Lo Barnechea,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipMF36...,-33.325961,-70.517112,Jumbo
1,"Av. Santa María 14.601, Colina, Región Metropo...",Colina,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipM-vf...,-33.321480,-70.645935,Jumbo
2,"Avendida Chicureo 130, Colina, Región Metropol...",Colina,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipNKQ5...,-33.285435,-70.700211,Jumbo

In [1103]:
df_tiendas = pd.concat([df_tiendas_tottus_1, df_tiendas_lider_1, df_tiendas_jumbo_1]).reset_index(drop=True)
df_tiendas.head(3)

,direccion,comuna,region,imagen,latitud,longitud,empresa
0,"Av Libertador Bernardo O'Higgins 3470, Santiago",Alameda,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipNBTs...,-33.452419,-70.682373,Tottus
1,"San Martín 174, Buin",Buín,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipObZ2...,-33.731760,-70.734828,Tottus
2,"Catedral 1850, Santiago",Catedral,Región Metropolitana,https://lh5.googleusercontent.com/p/AF1QipNgsl...,-33.438856,-70.663054,Tottus

In [1104]:
df_tiendas.isnull().sum()

direccion      0
comuna         0
region         0
imagen       136
latitud      135
longitud     135
empresa        0
dtype: int64

In [1105]:
df_tiendas['imagen'] = df_tiendas['imagen'].fillna('Imagen no encontrada')
df_tiendas['latitud'] = df_tiendas['latitud'].astype(str).str.replace('nan', 'Latitud no encontrada')
df_tiendas['longitud']= df_tiendas['longitud'].astype(str).str.replace('nan', 'Longitud no encontrada')

In [1106]:
df_tiendas.isnull().sum()

direccion    0
comuna       0
region       0
imagen       0
latitud      0
longitud     0
empresa      0
dtype: int64

In [1107]:
actual_date = str(datetime.now())[0:10]

df_tiendas.to_excel(ruta + f'data_tiendas.xlsx'.format(actual_date), index=0)

### Productos

In [1108]:
df_matching = pd.read_excel('homologacion-smartbuy/df_matching.xlsx')

In [1109]:
df_matching.shape

(22330, 29)

In [1110]:
vars_productos = ['id', 'name', 'description', 'marca', 'formato', 'precio', 'image1', 'image2', 'image3', 'empresa']

In [1111]:
df_productos = df_matching[vars_productos].drop_duplicates()
df_productos.head(3)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa
0,T110397175,Vino Tinto Cabernet Sauvignon Reserva - 750 CC,Vino Tinto Gran Reserva Valley Selection Botel...,valdivieso,750 cc,9230,https://7483c243aa9da28f329c-903e05bc00667eb97...,NaN,NaN,Tottus
1,T110617267,Vino Tinto Merlot Reserva - 750 CC,NaN,medalla-real,750 cc,5490,https://7483c243aa9da28f329c-903e05bc00667eb97...,NaN,NaN,Tottus
2,T110619820,VINO VIU MANENT GRAN RVA CA 750ML 14G,VINO VIU MANENT GRAN RVA CA 750ML 14G,viu-manent,750 cc,10150,https://7483c243aa9da28f329c-903e05bc00667eb97...,NaN,NaN,Tottus

In [1112]:
df_productos.isnull().sum()

id                 0
name               0
description       55
marca            246
formato            1
precio             0
image1             0
image2         21395
image3         21420
empresa            0
dtype: int64

In [1113]:
df_productos.shape

(21430, 10)

In [1114]:
df_productos.sort_values(['image1', 'precio'], ascending=[True, True], inplace=True)
df_productos['rank'] = 1
df_productos['rank'] = df_productos.groupby(['id'])['rank'].cumsum()
df_productos = df_productos[df_productos['rank']==1][vars_productos]
df_productos = df_productos.sort_values(['empresa', 'name']).reset_index(drop=True)

In [1115]:
df_productos.shape

(21399, 10)

In [1116]:
df_productos.shape[0], df_productos['id'].nunique()

(21399, 21399)

In [1117]:
df_productos[df_productos['precio']>0].shape

(21396, 10)

In [1118]:
df_productos[(df_productos['name']!='no info') & (df_productos['precio']>0)].shape

(21396, 10)

In [1119]:
actual_date = str(datetime.now())[0:10]

df_productos[(df_productos['name']!='no info') & (df_productos['precio']>0)].to_excel(ruta + f'data_productos.xlsx'.format(actual_date), index=0)

### Productos - Categorías

In [1120]:
vars_productos_cat = ['id', 'name', 'description', 'marca' ,'formato', 'empresa',
                        'cod_cat_n1_smt', 'categoria_nivel_1',
                        'cod_cat_n2_smt', 'categoria_nivel_2']

In [1121]:
df_productos.shape[0], df_productos['id'].nunique()

(21399, 21399)

In [1122]:
df_productos_cat = df_matching[vars_productos_cat].reset_index(drop=True).drop_duplicates()
df_productos_cat = df_productos_cat.sort_values(['empresa', 'name']).reset_index(drop=True)
df_productos_cat.head(3)

,id,name,description,marca,formato,empresa,cod_cat_n1_smt,categoria_nivel_1,cod_cat_n2_smt,categoria_nivel_2
0,J1887323,7 especias 70 g,¡Úsalo sólo y punto! Este condimento no necesi...,suk,70 g,Jumbo,D_001,Despensa,AYA_001,Aceites y Aderezos
1,J1949971,ALFAJOR CHOCOLATE DEUBEL 6UN,no info,deubel,deubel 6un,Jumbo,PYP_001,Panadería y Pastelería,PAS_001,Pastelería
2,J1949973,ALFAJOR SANTAFESINO DEUBEL 4 UN,no info,deubel,4 un,Jumbo,PYP_001,Panadería y Pastelería,PAS_001,Pastelería

In [1123]:
df_productos_cat.isnull().sum()

id                     0
name                   0
description           55
marca                265
formato                1
empresa                0
cod_cat_n1_smt         0
categoria_nivel_1      0
cod_cat_n2_smt         0
categoria_nivel_2      0
dtype: int64

In [1124]:
df_productos_cat.shape

(22330, 10)

In [1125]:
df_productos_cat[df_productos_cat['name']!='no info'].shape

(22329, 10)

In [1126]:
actual_date = str(datetime.now())[0:10]

df_productos_cat[(df_productos_cat['name']!='no info')].to_excel(ruta + f'data_productos_cat.xlsx'.format(actual_date), index=0)

### Código Smart Buy

#### Lider

In [1127]:
df_lider = df_productos[df_productos['empresa']=='Lider'].reset_index(drop=True)

In [1128]:
df_lider['cod_smt'] = df_lider.index+1
df_lider['cod_smt'] = 'SMT_' + df_lider['cod_smt'].astype(str).str.zfill(6)

In [1129]:
df_lider.shape, df_lider['id'].nunique()

((10346, 11), 10346)

In [1130]:
df_productos.shape

(21399, 10)

In [1131]:
df_productos_1 = pd.merge(df_productos, df_lider[['id', 'empresa', 'cod_smt']], on=['id', 'empresa'], how='left')

In [1132]:
df_productos_1.shape

(21399, 11)

In [1133]:
df_productos_1.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,cod_smt
0,J1887323,7 especias 70 g,¡Úsalo sólo y punto! Este condimento no necesi...,suk,70 g,3999,https://jumbo.vtexassets.com/arquivos/ids/5018...,NaN,NaN,Jumbo,NaN

In [1134]:
df_productos_1.shape

(21399, 11)

#### Jumbo

##### Jumbo vs Lider

In [1135]:
df_jumbo = df_productos[df_productos['empresa']=='Jumbo'].reset_index(drop=True)
df_jumbo.shape

(10413, 10)

In [1136]:
df_jumbo_2 = pd.merge(df_jumbo, df_matching[(df_matching['empresa']=='Jumbo')][['id', 'empresa', 'name_lider', 'score_lider', 'precio_lider', 'marca_lider', 'formato_lider']].drop_duplicates(), on=['id', 'empresa'], how='left')

In [1137]:
df_jumbo_2.shape

(10413, 15)

In [1138]:
df_productos_1.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,cod_smt
0,J1887323,7 especias 70 g,¡Úsalo sólo y punto! Este condimento no necesi...,suk,70 g,3999,https://jumbo.vtexassets.com/arquivos/ids/5018...,NaN,NaN,Jumbo,NaN

In [1139]:
df_prod_lider = df_productos_1[df_productos_1['empresa']=='Lider'][['name', 'marca', 'formato', 'cod_smt']]

In [1140]:
df_prod_lider['product'] = df_prod_lider['name'].astype(str) + ' ' +\
                            df_prod_lider['marca'].astype(str) + ' ' +\
                            df_prod_lider['formato'].astype(str)

In [1141]:
def remove_stopwords(lines, sw = sw):
    '''
    The purpose of this function is to remove stopwords from a given array of 
    lines.
    
    params:
        lines (Array / List) : The list of lines you want to remove the stopwords from
        sw (Set) : The set of stopwords you want to remove
        
    example:
        lines = remove_stopwords(lines = lines, sw = sw)
    '''
    
    res = []
    for line in lines:
        original = line
        line = [w for w in line if w not in sw]
        if len(line) < 1:
            line = original
        res.append(line)
    return res

In [1142]:
lines = df_prod_lider['product'].tolist()

# remove new lines
lines = [line.rstrip('\n') for line in lines]

# make all characters lower
lines = [line.lower() for line in lines]

# remove punctuations from each line
lines = [line.translate(str.maketrans('', '', string.punctuation)) for line in lines]

# tokenize
lines = [word_tokenize(line) for line in lines]
    
filtered_lines = remove_stopwords(lines = lines, sw = sw)

filtered_lines = [TreebankWordDetokenizer().detokenize(line) for line in filtered_lines]

In [1143]:
df_prod_lider['product'] = filtered_lines

In [1144]:
df_jumbo_3 = pd.merge(df_jumbo_2, df_prod_lider[['product', 'cod_smt']], left_on=['name_lider'], right_on=['product'], how='left')

In [1145]:
df_productos_1.shape

(21399, 11)

In [1146]:
df_productos_2 = pd.merge(df_productos_1, df_jumbo_3[['id', 'name_lider', 'score_lider', 'precio_lider', 'marca_lider', 'formato_lider', 'cod_smt']], on=['id'], how='left')

In [1147]:
df_productos_2.shape

(21469, 17)

In [1148]:
df_productos_2['cod_smt'] = np.where(df_productos_2['cod_smt_x'].isnull(), df_productos_2['cod_smt_y'], df_productos_2['cod_smt_x'])

In [1149]:
del df_productos_2['cod_smt_x'], df_productos_2['cod_smt_y']

In [1150]:
cols = df_productos.columns.tolist()
df_productos_2.sort_values(['score_lider', 'precio_lider'], ascending=[False, True], inplace=True)
df_productos_2['rank'] = 1
df_productos_2['rank'] = df_productos_2.groupby(cols, dropna=False)['rank'].cumsum()
df_productos_2 = df_productos_2[df_productos_2['rank']==1]
df_prod_jumbo = df_productos_2[df_productos_2['empresa']=='Jumbo']
df_productos_2 = df_productos_2[df_productos_1.columns]
df_productos_2.shape, df_productos_2[cols].drop_duplicates().shape

((21399, 11), (21399, 10))

In [1151]:
df_productos_2.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,6122
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,0

In [1152]:
df_productos_2.groupby('empresa').nunique()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10087,7885,1543,1503,1590,10406,0,0,3615
Lider,10346,9813,6726,1387,899,978,9462,0,0,10346
Tottus,640,632,579,173,162,324,640,35,10,0

In [1153]:
df_prod_jumbo.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,name_lider,score_lider,precio_lider,marca_lider,formato_lider,cod_smt,rank
2208,J302475,Chucrut bolsa 200 g,Don Juan es sabor auténtico. El sabroso y trad...,don juan,200 g,751,https://jumbo.vtexassets.com/arquivos/ids/4402...,NaN,NaN,Jumbo,chucrut bolsa 200 g don juan 200 g,100.0,980.0,don juan,200 g,SMT_002331,1

In [1154]:
df_prod_jumbo['var_precio'] = abs((df_prod_jumbo['precio_lider']-df_prod_jumbo['precio'])/df_prod_jumbo['precio'])

In [1155]:
df_prod_jumbo.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,name_lider,score_lider,precio_lider,marca_lider,formato_lider,cod_smt,rank,var_precio
2208,J302475,Chucrut bolsa 200 g,Don Juan es sabor auténtico. El sabroso y trad...,don juan,200 g,751,https://jumbo.vtexassets.com/arquivos/ids/4402...,NaN,NaN,Jumbo,chucrut bolsa 200 g don juan 200 g,100.0,980.0,don juan,200 g,SMT_002331,1,0.304927

In [1156]:
df_prod_jumbo.sort_values(['var_precio'], ascending=[True], inplace=True)
df_prod_jumbo['rank'] = 1
df_prod_jumbo['rank'] = df_prod_jumbo.groupby('cod_smt', dropna=False)['rank'].cumsum()
df_prod_jumbo = df_prod_jumbo[df_prod_jumbo['rank']==1]
del df_prod_jumbo['rank'], df_prod_jumbo['var_precio']
df_prod_jumbo.shape, df_prod_jumbo['cod_smt'].drop_duplicates().shape

((3616, 16), (3616,))

In [1157]:
df_productos_2 = pd.merge(df_productos_2, df_prod_jumbo[['id', 'cod_smt']], on=['id'], how='left')

In [1158]:
df_productos_2.shape

(21399, 12)

In [1159]:
df_productos_2['cod_smt'] = np.where(df_productos_2['empresa']=='Jumbo', df_productos_2['cod_smt_y'], df_productos_2['cod_smt_x'])

In [1160]:
del df_productos_2['cod_smt_x'], df_productos_2['cod_smt_y']

In [1161]:
df_productos_2.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,3615
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,0

In [1162]:
df_productos_2.groupby('empresa').nunique()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10087,7885,1543,1503,1590,10406,0,0,3615
Lider,10346,9813,6726,1387,899,978,9462,0,0,10346
Tottus,640,632,579,173,162,324,640,35,10,0

In [1163]:
df_productos_2['cod_smt'].sort_values(ascending=False).iloc[0][4:]

'010346'

In [1164]:
df_det_jumbo = df_productos_2[df_productos_2['empresa']=='Jumbo'].reset_index(drop=True)

In [1165]:
df_det_jumbo_1 = df_det_jumbo[df_det_jumbo['cod_smt'].isnull()].sort_values('name')
df_det_jumbo_1.head(3)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,cod_smt
5029,J1887323,7 especias 70 g,¡Úsalo sólo y punto! Este condimento no necesi...,suk,70 g,3999,https://jumbo.vtexassets.com/arquivos/ids/5018...,NaN,NaN,Jumbo,NaN
6122,J1949971,ALFAJOR CHOCOLATE DEUBEL 6UN,no info,deubel,deubel 6un,6490,https://jumbo.vtexassets.com/arquivos/ids/6619...,NaN,NaN,Jumbo,NaN
6123,J1949973,ALFAJOR SANTAFESINO DEUBEL 4 UN,no info,deubel,4 un,3990,https://jumbo.vtexassets.com/arquivos/ids/6620...,NaN,NaN,Jumbo,NaN

In [1166]:
df_productos_2['cod_smt'].sort_values(ascending=False).iloc[0]

'SMT_010346'

In [1167]:
last_lider = int(df_productos_2['cod_smt'].sort_values(ascending=False).iloc[0][4:])
last_lider

10346

In [1168]:
df_det_jumbo_1.shape[0]

6798

In [1169]:
len(range(last_lider+1, last_lider+df_det_jumbo_1.shape[0]+1))

6798

In [1170]:
df_det_jumbo_1['cod_smt'] = range(last_lider+1, last_lider+df_det_jumbo_1.shape[0]+1)
df_det_jumbo_1['cod_smt'] = 'SMT_' + df_det_jumbo_1['cod_smt'].astype(str).str.zfill(6)

In [1171]:
df_det_jumbo_1.shape, df_det_jumbo_1['id'].nunique()

((6798, 11), 6798)

In [1172]:
df_productos_2.shape

(21399, 11)

In [1173]:
df_productos_3 = pd.merge(df_productos_2, df_det_jumbo_1[['id', 'cod_smt']], on=['id'], how='left')

In [1174]:
df_productos_3.shape

(21399, 12)

In [1175]:
df_productos_3['cod_smt'] = np.where(df_productos_3['cod_smt_x'].isnull(), df_productos_3['cod_smt_y'], df_productos_3['cod_smt_x'])

In [1176]:
del df_productos_3['cod_smt_x'], df_productos_3['cod_smt_y']

In [1177]:
df_productos_3.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,10413
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,0

#### Tottus

##### Tottus vs Lider

In [1178]:
df_tottus = df_productos[df_productos['empresa']=='Tottus'].reset_index(drop=True)
df_tottus.shape

(640, 10)

In [1179]:
df_tottus_2 = pd.merge(df_tottus, df_matching[(df_matching['empresa']=='Tottus')][['id', 'empresa', 'name_lider', 'score_lider', 'precio_lider', 'marca_lider', 'formato_lider']].drop_duplicates(), on=['id', 'empresa'], how='left')

In [1180]:
df_tottus_2.shape

(640, 15)

In [1181]:
df_productos_3.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,cod_smt
0,J302475,Chucrut bolsa 200 g,Don Juan es sabor auténtico. El sabroso y trad...,don juan,200 g,751,https://jumbo.vtexassets.com/arquivos/ids/4402...,NaN,NaN,Jumbo,SMT_011775

In [1182]:
df_tottus_3 = pd.merge(df_tottus_2, df_prod_lider[['product', 'cod_smt']], left_on=['name_lider'], right_on=['product'], how='left')

In [1183]:
df_tottus_3.shape

(646, 17)

In [1184]:
df_productos_3.shape

(21399, 11)

In [1185]:
df_productos_4 = pd.merge(df_productos_3, df_tottus_3[['id', 'name_lider', 'score_lider', 'precio_lider', 'marca_lider', 'formato_lider', 'cod_smt']], on=['id'], how='left')

In [1186]:
df_productos_4.shape

(21405, 17)

In [1187]:
df_productos_4['cod_smt'] = np.where(df_productos_4['cod_smt_x'].isnull(), df_productos_4['cod_smt_y'], df_productos_4['cod_smt_x'])

In [1188]:
del df_productos_4['cod_smt_x'], df_productos_4['cod_smt_y']

In [1189]:
cols = df_productos.columns.tolist()
df_productos_4.sort_values(['score_lider', 'precio_lider'], ascending=[False, True], inplace=True)
df_productos_4['rank'] = 1
df_productos_4['rank'] = df_productos_4.groupby(cols, dropna=False)['rank'].cumsum()
df_productos_4 = df_productos_4[df_productos_4['rank']==1]
df_prod_tottus = df_productos_4[df_productos_4['empresa']=='Tottus']
df_productos_4 = df_productos_4[df_productos_1.columns]
df_productos_4.shape, df_productos_4[cols].drop_duplicates().shape

((21399, 11), (21399, 10))

In [1190]:
df_productos_4.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,10413
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,353

In [1191]:
df_productos_4.groupby('empresa').nunique()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10087,7885,1543,1503,1590,10406,0,0,10413
Lider,10346,9813,6726,1387,899,978,9462,0,0,10346
Tottus,640,632,579,173,162,324,640,35,10,278

In [1192]:
df_prod_tottus.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,name_lider,score_lider,precio_lider,marca_lider,formato_lider,cod_smt,rank
20822,T110611751,Arroz Rissoto Italiano - 1 KG,Arroz Risotto Italiano Tucapel,tucapel,1 kg,3460,https://s7d2.scene7.com/is/image/Tottus/202352...,NaN,NaN,Tottus,arroz risotto italiano 1 kg tucapel 1 kg,98.0,3990.0,tucapel,1 kg,SMT_000743,1

In [1193]:
df_prod_tottus['var_precio'] = abs((df_prod_tottus['precio_lider']-df_prod_tottus['precio'])/df_prod_tottus['precio'])

In [1194]:
df_prod_tottus.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,name_lider,score_lider,precio_lider,marca_lider,formato_lider,cod_smt,rank,var_precio
20822,T110611751,Arroz Rissoto Italiano - 1 KG,Arroz Risotto Italiano Tucapel,tucapel,1 kg,3460,https://s7d2.scene7.com/is/image/Tottus/202352...,NaN,NaN,Tottus,arroz risotto italiano 1 kg tucapel 1 kg,98.0,3990.0,tucapel,1 kg,SMT_000743,1,0.153179

In [1195]:
df_prod_tottus.sort_values(['var_precio'], ascending=[True], inplace=True)
df_prod_tottus['rank'] = 1
df_prod_tottus['rank'] = df_prod_tottus.groupby('cod_smt', dropna=False)['rank'].cumsum()
df_prod_tottus = df_prod_tottus[df_prod_tottus['rank']==1]
del df_prod_tottus['rank'], df_prod_tottus['var_precio']
df_prod_tottus.shape, df_prod_tottus['cod_smt'].drop_duplicates().shape

((279, 16), (279,))

In [1196]:
df_productos_4 = pd.merge(df_productos_4, df_prod_tottus[['id', 'cod_smt']], on=['id'], how='left')

In [1197]:
df_productos_4.shape

(21399, 12)

In [1198]:
df_productos_4['cod_smt'] = np.where(df_productos_4['empresa']=='Tottus', df_productos_4['cod_smt_y'], df_productos_4['cod_smt_x'])

In [1199]:
del df_productos_4['cod_smt_x'], df_productos_4['cod_smt_y']

In [1200]:
df_productos_4.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,10413
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,278

In [1201]:
df_productos_4.groupby('empresa').nunique()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10087,7885,1543,1503,1590,10406,0,0,10413
Lider,10346,9813,6726,1387,899,978,9462,0,0,10346
Tottus,640,632,579,173,162,324,640,35,10,278

##### Tottus vs Jumbo

In [1202]:
df_tottus_4 = pd.merge(df_tottus, df_matching[(df_matching['empresa']=='Tottus')][['id', 'empresa', 'name_jumbo', 'score_jumbo', 'precio_jumbo', 'marca_jumbo', 'formato_jumbo']].drop_duplicates(), on=['id', 'empresa'], how='left')

In [1203]:
df_tottus_4.shape

(640, 15)

In [1204]:
df_productos_4.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,cod_smt
0,T110611751,Arroz Rissoto Italiano - 1 KG,Arroz Risotto Italiano Tucapel,tucapel,1 kg,3460,https://s7d2.scene7.com/is/image/Tottus/202352...,NaN,NaN,Tottus,SMT_000743

In [1205]:
df_tottus_5 = pd.merge(df_tottus_4, df_prod_lider[['product', 'cod_smt']], left_on=['name_jumbo'], right_on=['product'], how='left')

In [1206]:
df_tottus_5.shape

(640, 17)

In [1207]:
df_productos_4.shape

(21399, 11)

In [1208]:
df_productos_5 = pd.merge(df_productos_4, df_tottus_5[['id', 'name_jumbo', 'score_jumbo', 'precio_jumbo', 'marca_jumbo', 'formato_jumbo', 'cod_smt']], on=['id'], how='left')

In [1209]:
df_productos_5.shape

(21399, 17)

In [1210]:
df_productos_5['cod_smt'] = np.where(df_productos_5['cod_smt_x'].isnull(), df_productos_5['cod_smt_y'], df_productos_5['cod_smt_x'])

In [1211]:
del df_productos_5['cod_smt_x'], df_productos_5['cod_smt_y']

In [1212]:
cols = df_productos.columns.tolist()
df_productos_5.sort_values(['score_jumbo', 'precio_jumbo'], ascending=[False, True], inplace=True)
df_productos_5['rank'] = 1
df_productos_5['rank'] = df_productos_5.groupby(cols, dropna=False)['rank'].cumsum()
df_productos_5 = df_productos_5[df_productos_5['rank']==1]
df_prod_tottus_1 = df_productos_5[df_productos_5['empresa']=='Tottus']
df_productos_5 = df_productos_5[df_productos_1.columns]
df_productos_5.shape, df_productos_5[cols].drop_duplicates().shape

((21399, 11), (21399, 10))

In [1213]:
df_productos_5.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,10413
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,280

In [1214]:
df_productos_5.groupby('empresa').nunique()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10087,7885,1543,1503,1590,10406,0,0,10413
Lider,10346,9813,6726,1387,899,978,9462,0,0,10346
Tottus,640,632,579,173,162,324,640,35,10,278

In [1215]:
df_prod_tottus_1.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,name_jumbo,score_jumbo,precio_jumbo,marca_jumbo,formato_jumbo,cod_smt,rank
8,T110619052,Espumante Brut - 750 CC,Vino Espumante Botella Brut Martini,martini,750 cc,12990,https://7483c243aa9da28f329c-903e05bc00667eb97...,NaN,NaN,Tottus,espumante brut 750 cc martini 750 cc,100.0,13390.0,martini,750 cc,SMT_003272,1

In [1216]:
df_prod_tottus_1['var_precio'] = abs((df_prod_tottus_1['precio_jumbo']-df_prod_tottus_1['precio'])/df_prod_tottus_1['precio'])

In [1217]:
df_prod_tottus_1.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,name_jumbo,score_jumbo,precio_jumbo,marca_jumbo,formato_jumbo,cod_smt,rank,var_precio
8,T110619052,Espumante Brut - 750 CC,Vino Espumante Botella Brut Martini,martini,750 cc,12990,https://7483c243aa9da28f329c-903e05bc00667eb97...,NaN,NaN,Tottus,espumante brut 750 cc martini 750 cc,100.0,13390.0,martini,750 cc,SMT_003272,1,0.030793

In [1218]:
df_prod_tottus_1.sort_values(['var_precio'], ascending=[True], inplace=True)
df_prod_tottus_1['rank'] = 1
df_prod_tottus_1['rank'] = df_prod_tottus_1.groupby('cod_smt', dropna=False)['rank'].cumsum()
df_prod_tottus_1 = df_prod_tottus_1[df_prod_tottus_1['rank']==1]
del df_prod_tottus_1['rank'], df_prod_tottus_1['var_precio']
df_prod_tottus_1.shape, df_prod_tottus_1['cod_smt'].drop_duplicates().shape

((279, 16), (279,))

In [1219]:
df_productos_5 = pd.merge(df_productos_5, df_prod_tottus_1[['id', 'cod_smt']], on=['id'], how='left')

In [1220]:
df_productos_5.shape

(21399, 12)

In [1221]:
df_productos_5['cod_smt'] = np.where(df_productos_5['empresa']=='Tottus', df_productos_5['cod_smt_y'], df_productos_5['cod_smt_x'])

In [1222]:
del df_productos_5['cod_smt_x'], df_productos_5['cod_smt_y']

In [1223]:
df_productos_5.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,10413
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,278

In [1224]:
df_productos_5.groupby('empresa').nunique()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10087,7885,1543,1503,1590,10406,0,0,10413
Lider,10346,9813,6726,1387,899,978,9462,0,0,10346
Tottus,640,632,579,173,162,324,640,35,10,278

In [1225]:
df_productos_5['cod_smt'].sort_values(ascending=False).iloc[0][4:]

'017144'

In [1226]:
df_det_tottus = df_productos_5[df_productos_5['empresa']=='Tottus'].reset_index(drop=True)

In [1227]:
df_det_tottus_1 = df_det_tottus[df_det_tottus['cod_smt'].isnull()].sort_values('name')
df_det_tottus_1.head(3)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,cod_smt
413,T110611243,ABRILLANTADOR FINISH 400 ML,ABRILLANTADOR FINISH 400 ML,finish,400 ml,4700,https://s7d2.scene7.com/is/image/Tottus/203631...,https://s7d2.scene7.com/is/image/Tottus/203631...,https://s7d2.scene7.com/is/image/Tottus/203631...,Tottus,NaN
16,T110615848,ACEITE MAIZ 1 LT. CH,ACEITE MAIZ 1 LT. CH,chef,1 l,4390,https://s7d2.scene7.com/is/image/Tottus/010200...,NaN,NaN,Tottus,NaN
414,T110610573,AGUA AQUARIUS PERA PET 1.6,AGUA AQUARIUS PERA PET 1.6,NaN,"1,6 l",870,https://s7d2.scene7.com/is/image/Tottus/202819...,NaN,NaN,Tottus,NaN

In [1228]:
df_productos_5['cod_smt'].sort_values(ascending=False).iloc[0]

'SMT_017144'

In [1229]:
last = int(df_productos_5['cod_smt'].sort_values(ascending=False).iloc[0][4:])
last

17144

In [1230]:
df_det_tottus_1.shape[0]

362

In [1231]:
len(range(last+1, last+df_det_tottus_1.shape[0]+1))

362

In [1232]:
df_det_tottus_1['cod_smt'] = range(last+1, last+df_det_tottus_1.shape[0]+1)
df_det_tottus_1['cod_smt'] = 'SMT_' + df_det_tottus_1['cod_smt'].astype(str).str.zfill(6)

In [1233]:
df_det_tottus_1.shape, df_det_tottus_1['id'].nunique()

((362, 11), 362)

In [1234]:
df_productos_5.shape

(21399, 11)

In [1235]:
df_productos_6 = pd.merge(df_productos_5, df_det_tottus_1[['id', 'cod_smt']], on=['id'], how='left')

In [1236]:
df_productos_6.shape

(21399, 12)

In [1237]:
df_productos_6['cod_smt'] = np.where(df_productos_6['cod_smt_x'].isnull(), df_productos_6['cod_smt_y'], df_productos_6['cod_smt_x'])

In [1238]:
del df_productos_6['cod_smt_x'], df_productos_6['cod_smt_y']

In [1239]:
df_productos_6.groupby('empresa').count()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10413,10413,10413,10413,10413,10413,0,0,10413
Lider,10346,10346,10346,10346,10346,10346,10346,0,0,10346
Tottus,640,640,585,394,639,640,640,35,10,640

In [1240]:
df_productos_6.groupby('empresa').nunique()

,id,name,description,marca,formato,precio,image1,image2,image3,cod_smt
empresa,,,,,,,,,,
Jumbo,10413,10087,7885,1543,1503,1590,10406,0,0,10413
Lider,10346,9813,6726,1387,899,978,9462,0,0,10346
Tottus,640,632,579,173,162,324,640,35,10,640

In [1241]:
df_productos_6.shape

(21399, 11)

In [1242]:
df_productos_6.head(1)

,id,name,description,marca,formato,precio,image1,image2,image3,empresa,cod_smt
0,T110619052,Espumante Brut - 750 CC,Vino Espumante Botella Brut Martini,martini,750 cc,12990,https://7483c243aa9da28f329c-903e05bc00667eb97...,NaN,NaN,Tottus,SMT_003272

In [1243]:
df_mmpp = pd.read_excel(ruta + 'mmpp.xlsx')

In [1244]:
lista_mmpp = df_mmpp['mmpp'].values.tolist()

In [1245]:
lista_mmpp

['lider', 'cuisine & co', 'tottus']

In [1246]:
df_productos_6['flag_mmpp'] = 0

In [1247]:
for mmpp in lista_mmpp:
    df_productos_6['flag_mmpp'] = np.where(df_productos_6['marca'].str.contains(mmpp), 1, df_productos_6['flag_mmpp'])

In [1248]:
df_productos_6['flag_mmpp'] = np.where(df_productos_6['marca'].isnull(), 0, df_productos_6['flag_mmpp'])

In [1249]:
df_productos_6.to_excel(ruta + f'data_productos.xlsx'.format(actual_date), index=0)

##### SmartBuy

In [1250]:
df_smt_1 = df_productos_6[df_productos_6['empresa']=='Lider'][['cod_smt', 'id', 'name', 'marca', 'formato' ,'precio']].\
            rename(columns={'id': 'id_lider',
                             'name': 'name_lider',
                             'marca': 'marca_lider',
                             'formato': 'formato_lider',
                             'precio': 'precio_lider'})

In [1251]:
df_smt_1.shape

(10346, 6)

In [1252]:
df_smt_jumbo = df_productos_6[df_productos_6['empresa']=='Jumbo'][['cod_smt', 'id', 'name', 'marca', 'formato' ,'precio']].\
            rename(columns={'id': 'id_jumbo',
                             'name': 'name_jumbo',
                             'marca': 'marca_jumbo',
                             'formato': 'formato_jumbo',
                             'precio': 'precio_jumbo'})

In [1253]:
df_smt_2 = pd.merge(df_smt_1, df_smt_jumbo, on=['cod_smt'], how='outer')

In [1254]:
df_smt_2.shape

(17144, 11)

In [1255]:
df_smt_2['var_precio'] = abs((df_smt_2['precio_lider']-df_smt_2['precio_jumbo'])/df_smt_2['precio_lider'])

In [1256]:
df_smt_2.head(1)

,cod_smt,id_lider,name_lider,marca_lider,formato_lider,precio_lider,id_jumbo,name_jumbo,marca_jumbo,formato_jumbo,precio_jumbo,var_precio
0,SMT_000001,L547336,"100% Fruta Durazno Y Manzana Pouch, 90 g",lider,90 g,450.0,NaN,NaN,NaN,NaN,NaN,NaN

In [1257]:
df_smt_2.sort_values(['var_precio'], ascending=[True], inplace=True)
df_smt_2['rank'] = 1
df_smt_2['rank'] = df_smt_2.groupby('cod_smt', dropna=False)['rank'].cumsum()
df_smt_2 = df_smt_2[df_smt_2['rank']==1]
del df_smt_2['rank'], df_smt_2['var_precio']
df_smt_2.shape, df_smt_2['cod_smt'].drop_duplicates().shape

((17144, 11), (17144,))

In [1258]:
df_smt_tottus = df_productos_6[df_productos_6['empresa']=='Tottus'][['cod_smt', 'id', 'name', 'marca', 'formato' ,'precio']].\
            rename(columns={'id': 'id_tottus',
                             'name': 'name_tottus',
                             'marca': 'marca_tottus',
                             'formato': 'formato_tottus',
                             'precio': 'precio_tottus'})

In [1259]:
df_smt_3 = pd.merge(df_smt_2, df_smt_tottus, on=['cod_smt'], how='outer')

In [1260]:
df_smt_3.shape

(17506, 16)

In [1261]:
df_smt_3['var_precio'] = abs((df_smt_3['precio_lider']-df_smt_3['precio_tottus'])/df_smt_3['precio_lider'])

In [1262]:
df_smt_3.head(1)

,cod_smt,id_lider,name_lider,marca_lider,formato_lider,precio_lider,id_jumbo,name_jumbo,marca_jumbo,formato_jumbo,precio_jumbo,id_tottus,name_tottus,marca_tottus,formato_tottus,precio_tottus,var_precio
0,SMT_008203,L337451,"Salanova Hojas, 150 gr",ensalada,150 g,2290.0,J1261606,Lechuga Salanova hojas 150 g,fresh cut,150 g,2290.0,NaN,NaN,NaN,NaN,NaN,NaN

In [1263]:
df_smt_3.sort_values(['var_precio'], ascending=[True], inplace=True)
df_smt_3['rank'] = 1
df_smt_3['rank'] = df_smt_3.groupby('cod_smt', dropna=False)['rank'].cumsum()
df_smt_3 = df_smt_3[df_smt_3['rank']==1]
del df_smt_3['rank'], df_smt_3['var_precio']
df_smt_3.shape, df_smt_3['cod_smt'].drop_duplicates().shape

((17506, 16), (17506,))

In [1264]:
df_smt_3.to_excel(ruta + f'data_productos_smartbuy.xlsx'.format(actual_date), index=0)

In [1265]:
df_smt_3.shape

(17506, 16)

In [1266]:
df_smt_3[df_smt_3['id_lider'].notnull()].shape, df_smt_3['id_lider'].nunique()

((10346, 16), 10346)

In [1267]:
df_smt_3[df_smt_3['id_jumbo'].notnull()].shape, df_smt_3['id_jumbo'].nunique()

((10413, 16), 10413)

In [1269]:
df_smt_3[df_smt_3['id_tottus'].notnull()].shape, df_smt_3['id_tottus'].nunique()

((640, 16), 640)